InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/DMA/Header/Peripheral/Register/RegisterDefines/DMA_RegisterDefines_SWREQ.h
/**
 *
 * @file DMA_RegisterDefines_SWREQ.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 28 jul. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 28 jul. 2020     vyldram    1.0         initial Version@endverbatim
 */
#ifndef XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERDEFINES_DMA_REGISTERDEFINES_SWREQ_H_
#define XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERDEFINES_DMA_REGISTERDEFINES_SWREQ_H_

#include <stdint.h>

/**************************************************************************************
************************************* 9 DMASWREQ *************************************
****************************************************************************************/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ0_MASK      ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_R_SWREQ0_BIT       ((uint32_t)0u)
#define DMA_DMASWREQ_R_SWREQ0_NOREQ     ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ0_REQ       ((uint32_t)0x00000001u)

#define DMA_DMASWREQ_SWREQ0_MASK        ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ0_NOREQ       ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ0_REQ         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ1_MASK      ((uint32_t)0x00000002u)
#define DMA_DMASWREQ_R_SWREQ1_BIT       ((uint32_t)1u)
#define DMA_DMASWREQ_R_SWREQ1_NOREQ     ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ1_REQ       ((uint32_t)0x00000002u)

#define DMA_DMASWREQ_SWREQ1_MASK        ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ1_NOREQ       ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ1_REQ         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ2_MASK      ((uint32_t)0x00000004u)
#define DMA_DMASWREQ_R_SWREQ2_BIT       ((uint32_t)2u)
#define DMA_DMASWREQ_R_SWREQ2_NOREQ     ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ2_REQ       ((uint32_t)0x00000004u)

#define DMA_DMASWREQ_SWREQ2_MASK        ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ2_NOREQ       ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ2_REQ         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ3_MASK      ((uint32_t)0x00000008u)
#define DMA_DMASWREQ_R_SWREQ3_BIT       ((uint32_t)3u)
#define DMA_DMASWREQ_R_SWREQ3_NOREQ     ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ3_REQ       ((uint32_t)0x00000008u)

#define DMA_DMASWREQ_SWREQ3_MASK        ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ3_NOREQ       ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ3_REQ         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ4_MASK      ((uint32_t)0x00000010u)
#define DMA_DMASWREQ_R_SWREQ4_BIT       ((uint32_t)4u)
#define DMA_DMASWREQ_R_SWREQ4_NOREQ     ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ4_REQ       ((uint32_t)0x00000010u)

#define DMA_DMASWREQ_SWREQ4_MASK        ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ4_NOREQ       ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ4_REQ         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ5_MASK      ((uint32_t)0x00000020u)
#define DMA_DMASWREQ_R_SWREQ5_BIT       ((uint32_t)5u)
#define DMA_DMASWREQ_R_SWREQ5_NOREQ     ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ5_REQ       ((uint32_t)0x00000020u)

#define DMA_DMASWREQ_SWREQ5_MASK        ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ5_NOREQ       ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ5_REQ         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ6_MASK      ((uint32_t)0x00000040u)
#define DMA_DMASWREQ_R_SWREQ6_BIT       ((uint32_t)6u)
#define DMA_DMASWREQ_R_SWREQ6_NOREQ     ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ6_REQ       ((uint32_t)0x00000040u)

#define DMA_DMASWREQ_SWREQ6_MASK        ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ6_NOREQ       ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ6_REQ         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ7_MASK      ((uint32_t)0x00000080u)
#define DMA_DMASWREQ_R_SWREQ7_BIT       ((uint32_t)7u)
#define DMA_DMASWREQ_R_SWREQ7_NOREQ     ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ7_REQ       ((uint32_t)0x00000080u)

#define DMA_DMASWREQ_SWREQ7_MASK        ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ7_NOREQ       ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ7_REQ         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ8_MASK      ((uint32_t)0x00000100u)
#define DMA_DMASWREQ_R_SWREQ8_BIT       ((uint32_t)8u)
#define DMA_DMASWREQ_R_SWREQ8_NOREQ     ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ8_REQ       ((uint32_t)0x00000100u)

#define DMA_DMASWREQ_SWREQ8_MASK        ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ8_NOREQ       ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ8_REQ         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ9_MASK      ((uint32_t)0x00000200u)
#define DMA_DMASWREQ_R_SWREQ9_BIT       ((uint32_t)9u)
#define DMA_DMASWREQ_R_SWREQ9_NOREQ     ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ9_REQ       ((uint32_t)0x00000200u)

#define DMA_DMASWREQ_SWREQ9_MASK        ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ9_NOREQ       ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ9_REQ         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ10_MASK     ((uint32_t)0x00000400u)
#define DMA_DMASWREQ_R_SWREQ10_BIT      ((uint32_t)10u)
#define DMA_DMASWREQ_R_SWREQ10_NOREQ    ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ10_REQ      ((uint32_t)0x00000400u)

#define DMA_DMASWREQ_SWREQ10_MASK       ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ10_NOREQ      ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ10_REQ        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ11_MASK     ((uint32_t)0x00000800u)
#define DMA_DMASWREQ_R_SWREQ11_BIT      ((uint32_t)11u)
#define DMA_DMASWREQ_R_SWREQ11_NOREQ    ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ11_REQ      ((uint32_t)0x00000800u)

#define DMA_DMASWREQ_SWREQ11_MASK       ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ11_NOREQ      ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ11_REQ        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ12_MASK     ((uint32_t)0x00001000u)
#define DMA_DMASWREQ_R_SWREQ12_BIT      ((uint32_t)12u)
#define DMA_DMASWREQ_R_SWREQ12_NOREQ    ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ12_REQ      ((uint32_t)0x00001000u)

#define DMA_DMASWREQ_SWREQ12_MASK       ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ12_NOREQ      ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ12_REQ        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ13_MASK     ((uint32_t)0x00002000u)
#define DMA_DMASWREQ_R_SWREQ13_BIT      ((uint32_t)13u)
#define DMA_DMASWREQ_R_SWREQ13_NOREQ    ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ13_REQ      ((uint32_t)0x00002000u)

#define DMA_DMASWREQ_SWREQ13_MASK       ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ13_NOREQ      ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ13_REQ        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ14_MASK     ((uint32_t)0x00004000u)
#define DMA_DMASWREQ_R_SWREQ14_BIT      ((uint32_t)14u)
#define DMA_DMASWREQ_R_SWREQ14_NOREQ    ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ14_REQ      ((uint32_t)0x00004000u)

#define DMA_DMASWREQ_SWREQ14_MASK       ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ14_NOREQ      ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ14_REQ        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ15_MASK     ((uint32_t)0x00008000u)
#define DMA_DMASWREQ_R_SWREQ15_BIT      ((uint32_t)15u)
#define DMA_DMASWREQ_R_SWREQ15_NOREQ    ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ15_REQ      ((uint32_t)0x00008000u)

#define DMA_DMASWREQ_SWREQ15_MASK       ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ15_NOREQ      ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ15_REQ        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ16_MASK     ((uint32_t)0x00010000u)
#define DMA_DMASWREQ_R_SWREQ16_BIT      ((uint32_t)16u)
#define DMA_DMASWREQ_R_SWREQ16_NOREQ    ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ16_REQ      ((uint32_t)0x00010000u)

#define DMA_DMASWREQ_SWREQ16_MASK       ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ16_NOREQ      ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ16_REQ        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ17_MASK     ((uint32_t)0x00020000u)
#define DMA_DMASWREQ_R_SWREQ17_BIT      ((uint32_t)17u)
#define DMA_DMASWREQ_R_SWREQ17_NOREQ    ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ17_REQ      ((uint32_t)0x00020000u)

#define DMA_DMASWREQ_SWREQ17_MASK       ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ17_NOREQ      ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ17_REQ        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ18_MASK     ((uint32_t)0x00040000u)
#define DMA_DMASWREQ_R_SWREQ18_BIT      ((uint32_t)18u)
#define DMA_DMASWREQ_R_SWREQ18_NOREQ    ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ18_REQ      ((uint32_t)0x00040000u)

#define DMA_DMASWREQ_SWREQ18_MASK       ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ18_NOREQ      ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ18_REQ        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ19_MASK     ((uint32_t)0x00080000u)
#define DMA_DMASWREQ_R_SWREQ19_BIT      ((uint32_t)19u)
#define DMA_DMASWREQ_R_SWREQ19_NOREQ    ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ19_REQ      ((uint32_t)0x00080000u)

#define DMA_DMASWREQ_SWREQ19_MASK       ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ19_NOREQ      ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ19_REQ        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ20_MASK     ((uint32_t)0x00100000u)
#define DMA_DMASWREQ_R_SWREQ20_BIT      ((uint32_t)20u)
#define DMA_DMASWREQ_R_SWREQ20_NOREQ    ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ20_REQ      ((uint32_t)0x00100000u)

#define DMA_DMASWREQ_SWREQ20_MASK       ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ20_NOREQ      ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ20_REQ        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ21_MASK     ((uint32_t)0x00200000u)
#define DMA_DMASWREQ_R_SWREQ21_BIT      ((uint32_t)21u)
#define DMA_DMASWREQ_R_SWREQ21_NOREQ    ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ21_REQ      ((uint32_t)0x00200000u)

#define DMA_DMASWREQ_SWREQ21_MASK       ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ21_NOREQ     ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ21_REQ       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ22_MASK     ((uint32_t)0x00400000u)
#define DMA_DMASWREQ_R_SWREQ22_BIT      ((uint32_t)22u)
#define DMA_DMASWREQ_R_SWREQ22_NOREQ    ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ22_REQ      ((uint32_t)0x00400000u)

#define DMA_DMASWREQ_SWREQ22_MASK       ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ22_NOREQ      ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ22_REQ        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ23_MASK     ((uint32_t)0x00800000u)
#define DMA_DMASWREQ_R_SWREQ23_BIT      ((uint32_t)23u)
#define DMA_DMASWREQ_R_SWREQ23_NOREQ    ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ23_REQ      ((uint32_t)0x00800000u)

#define DMA_DMASWREQ_SWREQ23_MASK       ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ23_NOREQ      ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ23_REQ        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ24_MASK     ((uint32_t)0x01000000u)
#define DMA_DMASWREQ_R_SWREQ24_BIT      ((uint32_t)24u)
#define DMA_DMASWREQ_R_SWREQ24_NOREQ    ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ24_REQ      ((uint32_t)0x01000000u)

#define DMA_DMASWREQ_SWREQ24_MASK       ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ24_NOREQ      ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ24_REQ        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ25_MASK     ((uint32_t)0x02000000u)
#define DMA_DMASWREQ_R_SWREQ25_BIT      ((uint32_t)25u)
#define DMA_DMASWREQ_R_SWREQ25_NOREQ    ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ25_REQ      ((uint32_t)0x02000000u)

#define DMA_DMASWREQ_SWREQ25_MASK       ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ25_NOREQ      ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ25_REQ        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ26_MASK     ((uint32_t)0x04000000u)
#define DMA_DMASWREQ_R_SWREQ26_BIT      ((uint32_t)26u)
#define DMA_DMASWREQ_R_SWREQ26_NOREQ    ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ26_REQ      ((uint32_t)0x04000000u)

#define DMA_DMASWREQ_SWREQ26_MASK       ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ26_NOREQ      ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ26_REQ        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ27_MASK     ((uint32_t)0x08000000u)
#define DMA_DMASWREQ_R_SWREQ27_BIT      ((uint32_t)27u)
#define DMA_DMASWREQ_R_SWREQ27_NOREQ    ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ27_REQ      ((uint32_t)0x08000000u)

#define DMA_DMASWREQ_SWREQ27_MASK       ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ27_NOREQ      ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ27_REQ        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ28_MASK     ((uint32_t)0x10000000u)
#define DMA_DMASWREQ_R_SWREQ28_BIT      ((uint32_t)28u)
#define DMA_DMASWREQ_R_SWREQ28_NOREQ    ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ28_REQ      ((uint32_t)0x10000000u)

#define DMA_DMASWREQ_SWREQ28_MASK       ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ28_NOREQ      ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ28_REQ        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ29_MASK     ((uint32_t)0x20000000u)
#define DMA_DMASWREQ_R_SWREQ29_BIT      ((uint32_t)29u)
#define DMA_DMASWREQ_R_SWREQ29_NOREQ    ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ29_REQ      ((uint32_t)0x20000000u)

#define DMA_DMASWREQ_SWREQ29_MASK       ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ29_NOREQ      ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ29_REQ        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ30_MASK     ((uint32_t)0x40000000u)
#define DMA_DMASWREQ_R_SWREQ30_BIT      ((uint32_t)30u)
#define DMA_DMASWREQ_R_SWREQ30_NOREQ    ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ30_REQ      ((uint32_t)0x40000000u)

#define DMA_DMASWREQ_SWREQ30_MASK       ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ30_NOREQ      ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ30_REQ        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMASWREQ_R_SWREQ31_MASK     ((uint32_t)0x80000000u)
#define DMA_DMASWREQ_R_SWREQ31_BIT      ((uint32_t)31u)
#define DMA_DMASWREQ_R_SWREQ31_NOREQ    ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_R_SWREQ31_REQ      ((uint32_t)0x80000000u)

#define DMA_DMASWREQ_SWREQ31_MASK       ((uint32_t)0x00000001u)
#define DMA_DMASWREQ_SWREQ31_NOREQ      ((uint32_t)0x00000000u)
#define DMA_DMASWREQ_SWREQ31_REQ        ((uint32_t)0x00000001u)
/*--------*/

#endif /* XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERDEFINES_DMA_REGISTERDEFINES_SWREQ_H_ */
